test_create_directory.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" 
               xmlns:file="http://soap.appserver.example.com/">
   <soap:Header/>
   <soap:Body>
      <file:createDirectory>
         <file:username>testuser</file:username>
         <file:path>documents</file:path>
      </file:createDirectory>
   </soap:Body>
</soap:Envelope>